# inspired by https://catskull.net/how-i-set-up-macos-for-web-development.html

tap "buo/cask-upgrade" # brew cu -a to update all apps
tap "homebrew-ffmpeg/ffmpeg" # bleeding edge ffmpeg

brew "atuin" # smarter shell history
brew "curl" # http requests
brew "direnv" # .env files per directory
brew "fd" # find files
brew "findutils" # more shell programs
brew "fzf" # fuzzy find
brew "gh" # github
brew "git" # version control system
brew "gnupg" # gpg
brew "grep" # gnu version, saner flags
brew "homebrew-ffmpeg/ffmpeg/ffmpeg" # media conversion
brew "htop" # process manager
brew "jj" # version control system
brew "jq" # json parsing on cli
brew "just" # make alternative
brew "llm" # use llms on cli
brew "make" # gnu version
brew "mas" # mac app store cli
brew "mise" # tool version manager
brew "neovim" # text editor
brew "parallel" # run commands in parallel
brew "ripgrep" # faster grep
brew "rsync" # sync files between systems
brew "starship" # shell prompt
brew "stow" # pop dotfiles into place
brew "tmux" # multiplexer
brew "tree" # tree view of files
brew "vim" # text editor
brew "watch" # watch for a program to complete
brew "wget" # file downloader
brew "yt-dlp" # youtube downloader
brew "zsh" # shell

cask "1password" # password manager
cask "nikitabobko/tap/aerospace" # window manager
cask "affinity-designer" # vector image editor
cask "affinity-photo" # bitmap image editor
cask "cleanshot" # screenshots
cask "fantastical" # calendar
cask "firefox" # browser
cask "ghostty" # terminal emulator
cask "hammerspoon" # mac automation
cask "jordanbaird-ice" # menubar manager
cask "monitorcontrol" # external monitor control
cask "netnewswire" # rss
cask "obsidian" # notes
cask "omnidisksweeper" # disk space visualiser
cask "orbstack" # docker containers
cask "raycast" # app launcher
cask "swiftbar" # custom menu bar programs
cask "syncthing-app" # folder sync
cask "tailscale-app" # vpn

mas "Keynote", id: 409183694
mas "Pages", id: 409201541

